---
title: DocumentClosedEventArgs
classe: Autodesk.Revit.DB.Events.DocumentClosedEventArgs
namespace: Autodesk.Revit.DB.Events
eredita: Autodesk.Revit.DB.Events.RevitAPIPostEventArgs
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 1
---

# DocumentClosedEventArgs

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 DocumentId { get; }` | `documentClosedEventArgs.DocumentId` | Int32 |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```